---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorMightLookWrong
source: html/cc2215ff-d9a2-6e2f-adcd-5d7d4314efc5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorMightLookWrong Property

Mass Floors may appear incorrect since the Mass contains mesh and solid geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId FloorMightLookWrong { get; }
```